app/controllers/artists_controller.rb

INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "NewA"], ["created_at", "2020-05-20 20:17:00.190094"], ["updated_at", "2020-05-20 20:17:00.190094"]]
---
  def create
    @artist = Artist.new(artist_params)

    if @artist.save